# 인공지능의 분야

# 규칙 기반 시스템 -> 사람이 규칙을 정해두면 출력을 하는 방식
# 고전적 기계학습 -> 특징 추출 -> 특징 조합(computer) -> 출력
# 표현학습 -> 간단한 특징 추출(model) -> 특징 조합(model) -> 출력
# 심층 학습 -> 간단한 특징 추출(model) -> 복잡한 특징 추출(model) -> 특징 조합(model) -> 출력
# 데이터로부터 컴퓨터가 스스로 학습하고 추출하는 방식으로 규칙 기반 시스템과는 기계학습은 다름

# 기계학습: 프로그램이 작업의 집합(T)과 성능지표(P)에 대해서 경험(E)으로부터 학습한다는 것은, 집합 내의 작업들에 대해서 지표로 측정한 성능이
#          경험에 의해서 개선된는 것을 의미

# 작업(T): 흉부 영상을 이용해 암이 있는지 진단하는 분류 문제
# 성능지표(P): 영상이 정확하게 분류된 비율-> 정확도
# 경험(E): 과거부터 모인 흉부 X-ray 영상들과 그에 해당하는 정답(학습 데이터)
# => 흉부 X-ray 영상을 이용한 암환자 분류 작업에 대해서 정확도가 학습 데이터에 의해서 개선됨을 의미
# 작업, 성능지표, 경험을 명확하게 설정해야 함

# 응용 분야
# 1. Computer Vision
#    - 조직 영상으로부터 암세포 검출
#    - 흉부 X-ray 영상으로부터 암 진단
#    - 혈관 영상에서 잡음 제거
# 2. Natural Language Processing
#    - 판독기록문으로부터 정보 추출
#    - 판독기록문 생성
#    - 의료 챗
# 3. Signal Processing
#    - 뇌전도를 이용하여 외부 장치 조종
#    - 뇌전도를 이용하여 이미지 재생
# 4. Others
#    - 단백질 구조예측
#    - 신약 개발

# Task:
# 1. Classification -> 데이터가 어느 범주에 속하는지 예측
# 2. Anomaly Detection -> 데이터 집합 중 비정상적인 데이터 검출
# 3. Object Detection -> 주어진 이미지로부터 특정 물체 검출
# 4. Object Segmentation -> 이미지의 모든 픽셀의 범주를 예

# data
# 1. Sample -> 학습 알고리즘이 처리해야 하는 값
# 2. Label -> 학습 알고리즘이 출력해야 하는 값
# 3. Feature -> 입력 데이터의 구성 요소
# 4. Training data, Vaildation data,Test data
#    - 학습 데이터: 학습 알고리즘에 필요한 데이터
#    - 검증 데이터초매개변수(학습으로 찾을 수 없어, 사전에 결정되어야 하는 값)등을 찾기 위한 데이터
#    - 시험 데이터: 알고리즘의 성능을 평가하기 위한 데이터