# CNN

# 사람은 이미지를 어떻게 인식할까?
#    1. 각 단계별로 정보를 추출하는 필터가 존재
#    2. 테두리(edge), 방향, 색 등 간단한 특징 추출
#    3. 이전 단계의 정보를 종합하여 더 추상적인 특징 추출
#    4. 이를 통해서 물체를 인식함.


# Convolution, 합성곱
#    - 두 함수 f와 g에 대해서, 하나의 함수를 반전시킨 후, 이동시키 곱한 값의 적분
#    - 신호 및 시스템의 나온 Convolution과 같음 -> filp & swipe
#    - 두 함수가 가장 많이 겹치는, 비슷한 부분을 가질 때 가장 큰 값을 갖는다.

# Convolution layer
#    - 필터(filter) 혹은 커널(kernel)이라고 불리우는 행렬을 합성곱 연산을 함
#    - filter/kernel을 window size의 stride 크기로 sliding하여 연산 수행
#    - 입력 이미지를 조금 흐릿하게 -> 블러 필터
#    - 입력 이미지에서 엣지 추출 -> 엣지 디텍션 필터
#    - 입력 이미지를 더 밝게 표현 -> 라이튼 필터
#    - 입력 이미지에서 엣지를 더욱 강조 -> 샬픈 필터
#    - 이전에는 사람이 수작업으로 feature를 수행했지만 convolution을 통해서 자동 feature를 추출

# Stride
#    - 슬라이딩 윈도우를 적용할 간격을 나타내는 초매개변수
#    - Stride의 크기로 Convolution의 feature map의 size가 달라짐

# Padding
#    - Convolution의 연산으로 인해서 입력 이미지의 크기가 과하게 작아지는 것을 막고, 테두리의 정보 손실을 막고자 함.
#    - Zero padding이 대표적

# RGB 이미지의 처리
#    - 입력 특징이 복수의 채널로 이루어져 있다면, 필터도 같은 수의 채널 필요
#    - RGB 채널 3개
#    - Input Image의 채널 수와 filter의 채널 수는 동일함
#    - 여러 특징을 추출하고 싶은 경우, 그 만큼 개수의 커널을 이용하여 각각 연산 -> depth로 수행한다고 생각하면 됨