# 딥러닝 프레임워크란(Deep Learning Frameworks)?
#     - 딥러닝 프레임워크는 사용자로 하여금 간편하게 딥러닝 모델을 사용할 수 있게 함
#         - GPU 사용
#         - 자동 미분
#         - 수치 연산
#         - 배포 및 자동화 파이프라인

# Tensorflow
#     - 구글에서 공식적으로 제공하는 딥러닝 프레임워크
#     - 정적 그래프(모델의 구조를 학습 이전에 고정하여 다시는 변경할 수 없음, 사전의 빌드해서 사용 가능, 입력의 형태도 고정),
#       동적 그래프(데이터가 입력될 때마 모델의 구조를 변경하여 사용, 정적 그래프보다 느리지만 다양한 모델 구조 테스트 가 ) 지원
#     - 모델 서비스를 위한 강력한 기등들 제공(TensorFlow Serving, TensorFlow.js, TensorFlow Lite)
#     - 최근 연구용으로 덜 사용되고 있으나, 여전히 모델 배포  등에는 자주 사용됨.


# PyTorch
#     - 메타에서 만들고 관리하는 프레임워크
#         - 동적 그래프를 사용
#         - 코드가 Numpy와 유사하며, 더 파이썬스러운 코드를 제공
#         - 약간 느리지만, 디버깅이 쉬워서 연구 등에서 많이 사용
#
#     - 최근에는 연구뿐 아니라, 실제 상품에서도 많이 사용되고 있음

# JAX
#     - 구글에서 개발 및 유지하고 있는 비공식 프레임워크
#         - 구글과 딥마인드에서 최근 많이 사용되고 있음
#         - JIT 사용 등으로 빠른 속도를 자랑
#         - 아직 생태계가 크지 않음
#
#     - Flex나 Haiku 라이브러리를 사용하여 신경망 생성 가능